autocompletion_framework.org
* Autocompletion framework built upon Vertico, Consult and Embark elisp libraries
** My web clippings about the Minad stack. No code, prose only.
Vertico, an Ivy replacement;  Consult, a Counsel replacement

TODO compare ivy to vertico, [[https://youtu.be/5ffb2at2d7w?t=822][Using Emacs Episode 80 - Vertico, Marginalia, Consult, and Embark - YouTube :: Embark]]
and decide if vertico can be a better than +helm+ ivy for me.
#+begin_quote https://old.reddit.com/r/emacs/comments/ol2luk/from_ivy_counsel_to_vertico_consult/#:~:text=Start%20with%20plain,to%20helm-mini.
1. Start with plain Emacs.
2. Install vertico and enable vertico-mode to get incremental minibuffer completion.
3. Install orderless and/or configure the built-in completion styles for more flexible minibuffer filtering.
4. Install marginalia if you like rich minibuffer annotations. Exisiting commands are enhanced with these annotations, e.g., find-file.
5. Install embark and add two keybindings for embark-dwim and embark-act. I am using M-. and C-.. These commands allow you to act on the object at point or in the minibuffer. No actions on multiple candidates for now though.
6. Install consult if you want additional featureful completion commands, e.g, the buffer switcher consult-buffer with preview or the line-based search consult-line. consult-buffer can work with multiple candidate sources similar to helm-mini.
#+end_quote

#+begin_quote https://lambdaland.org/posts/2023-05-31_warp_factor_refactor/
Here’s the short of what each package does:

Vertico
Turns the default minibuffer completion UI into an auto-updating list of candidates. This lets us interact with “candidates”—or more specifically in our case, lines matching a pattern across our entire project—in a fast and accessible way.

Consult
Adds a bunch of completing-read-based functions. This lets us use ripgrep with Vertico’s UI.

Embark
Kind of like a generalized keyboard-focused right-click on crazy steroids. This lets us export our list of matches out of Vertico’s UI and into a buffer that wgrep can use.
#+end_quote
Try out Vertico with this example usecase: [[https://lambdaland.org/posts/2023-05-31_warp_factor_refactor/][Warp Factor Refactoring in Emacs | Lambda Land]]

[[https://protesilaos.com/codelog/2024-02-17-emacs-modern-minibuffer-packages/][Emacs: modern minibuffer packages (Vertico, Consult, etc.) | Protesilaos Stavrou - youtube video]]

[[https://macowners.club/posts/from-ivy-to-vertico/][From Ivy & Counsel to Vertico & Consult | macOS & (open-source) Software]]
#+begin_quote https://macowners.club/posts/from-ivy-to-vertico/
One major one being that Vertico & Consult automagically use the Emacs built-in system completing-read.

Example:
Instead of using a custom command counsel-find-file for finding files, I can just find-file and Vertico takes over. Other functions/commands using completion will automatically hand over to Vertico as well. No configuration needed on my part. This is munch much better
#+end_quote

[[https://systemcrafters.net/live-streams/may-21-2021/][Replacing Ivy and Counsel with Vertico and Consult - System Crafters video]]

Awesome vertico custom UI:-
#+begin_quote https://old.reddit.com/r/emacs/comments/v9w03w/have_the_cool_kids_moved_from_ivy_counsel_to/
On the whole, Vertico’s flexibility and general quality is so high that it should be considered for inclusion in Emacs core and should be turned on by default. 

The vertico-multiform feature is fabulous and has no equivalent. It permits making completion as in-your-face or as unobtrusive as you want depending on context. Say I want M-x to use posframe in GUI (but not terminal), buffer operations to use unobtrusive display (no big minibuffer), and imenu commands to use grid display.

The relevant snippet looks like this (example changed to my actual display setup: file operations use unobtrusive mode, buffer operations use flat ido-style, and a few other self-explanatory things). Posframe display requires vertico-posframe package.
#+end_quote

Best comparision by the author of Embark:-
#+begin_quote https://old.reddit.com/r/emacs/comments/117zdnu/what_are_the_benefits_of_vertico_over_helm_or_ivy/
[–]oantolinC-x * q 100! RET 28 points 1 year ago 
This is probably clear to everybody, but taking the question literally, Helm is significantly more featureful than Ivy, which in turn is significantly more featureful than Vertico. I think everybody wisely interpreted the question instead as comparing Helm to Ivy + Swiper + Counsel and to Vertico + Consult + Orderless + Embark + Marginalia + Corfu.

My favorite system is the latter (which you might think is obvious since I wrote Orderless and Embark, but that's not automatic for me: for example, I've written several completion UIs that I used for a while but ditched them for the vastly superior Vertico, so just because I wrote a package doesn't automatically make it my favorite package for that purpose!), but I used Helm and Ivy + Swiper + Counsel previously and they are both great systems. I didn't stop using Helm because I was dissatisfied with it, nor did I stop using Ivy + Swiper + Counsel out of dissatisfaction either. All three systems have a broad base of common functionality with some comparatively small advantages or disavantages over each other. Which is best for you depends on the weight you give to those advantages or disadvantages.

(Also, I should point out none of these systems are pioneers! Icicles has had this broad base of common functionality for decades longer than any of these three!)

So here are the advantages of the Vertico & friends system which I personally value the most (I think they all boil down to generality and configurability):

Consult previews!

Helm and Ivy have great support for actions on completion candidates, but Embark extends this in a uniform way to actions on things found in text buffers. I'm pretty sure I use Embark quite a bit more in regular buffers than in minibuffers now.

Vertico can show completions in the minibuffer, a dedicated buffer, a grid, a horizontal line or only show the top completion; this is configurable per command! This is much more flexible than either Helm or Ivy. And Corfu gives you nice popups at point for completions in regular buffers.

Ivy and Helm offer out of order matching (and Helm at least makes it available as a completion style, so you can use Helm matching with other completion UIs), but Orderless's syntax is highly configurable.

It is easy to add actions to Ivy commands or to Helm commands, but if you have a "normal" command, i.e., one that uses completing-read directly as most Emacs built-in commands, you need to write a small wrapper to make into an Ivy or Helm command before you can add actions; similarly if you have an Emacs command you want to use as an action you need to write a small wrapper before you can use it as an action for an Ivy or Helm command. With Embark, any command can use any other command as an action, and the action does not need to be registered in advance as an action. This is obviously not a very big deal: was it hard to write a bunch of 3 line wrappers for commands I wanted to use as Ivy actions? Of course not! Was it nice to delete those wrappers and use the commands as actions directly with Embark? Yes! :)

Embark lets you get a persistent buffer with completion candidates for any command so you can inspect them at your leisure and run actions on them later. Helm doesn't have this (it does let you restart any recent Helm command, which can be used for some of the same purposes), and Ivy has it only for Ivy commands, not "normal" commands.

You actually have two choices for these persistent buffers of completion candidates: Embark can "export" to major mode specific to the type of candidates (like dired for files, ibuffer for buffers, package-menu-mode for packages, grep-mode or occur-mode for search results, etc), or it can make an Embark Collect buffer, which works for any type of candidate at all and is dired-like: you can mark multiple candidates and run an action on all of them at once. I really enjoy the export version which reuses mode I already know and love, and consider the collect buffers as more of a back up for when there is no relevant major mode. In both cases, Embark lets you easily rerun the command you got the candidates from so you can get updated candidates for that input, or even tweak the input a bit before re-exporting or re-collecting.
#+end_quote
#+begin_quote https://github.com/oantolin/embark
This is how Embark manages to reuse normal commands as actions. The mechanism allows you to use as Embark actions commands that were not written with Embark in mind (and indeed almost all actions that are bound by default in Embark’s action keymaps are standard Emacs commands). It also allows you to write new custom actions in such a way that they are useful even without Embark.
#+end_quote

#+begin_quote https://old.reddit.com/r/emacs/comments/x7ahgz/how_many_of_you_switched_from_ivycounsel_or_helm/
[–]offby2doom | holy | 🐍 7 points 2 years ago 
I've struggled to grok the outlines of the completion frameworks in Emacs. Would you mind sharing the pages or documentation that helped you gain that understanding?

permalinkembedsaveparentreportreply

[–]WallyMetropolis 29 points 2 years ago* 
I'm not sure exactly what you're asking for, but here's a shot:

I think a good place to start is to read the documentation for completing-read and play with some very simple examples, like put this in some elisp buffer:

(completing-read "Animals: " '(cat dog walrus))
And see what happens when eval that if you have vertico-mode on or off. So you'll sort of get the sense that vertico (or selectrum) are for displaying possible completions from a completing-read. Without it, you can't explore the options, but you can still enter the first character and tab-complete them.

But that's just for minibuffer completions. If you want completion in a regular buffer, generally prompted by a "TAB" you'd use company or maybe corfu.

So then the question is: where do the completion options come from? Part of the answer is determined by the completion style, which the emacs docs describe as a set of rules for generating completions. Orderless and Prescient are examples. They will filter down a large list of possible completions based on certain criteria.

Consult provides further tools to generate and combine lists for different purposes, as well as previewing selections as you cycle through them. So for example, if you have several themes downloaded, consult-theme can identify that and provide you with a completion list of the names of those themes. It also "does what you mean" when you select an option. So again, for consult-theme, it knows that if you select a theme from the list, it should disable any other active theme and enable the selected one, instead of just returning the selection as normal.

Marginalia just adds some flair to the completion UI (vertico/selectrum) to show some documentation about each option.

Embark is a bit of a separate thing entirely that is somewhat independent to, but plays well with, completions. It basically lets you call a context-aware function and enter the object you've selected as the argument to that function. So if you've selected a symbol in an elisp buffer, Embark would offer you various functions to run that can accept a symbol as an argument. I'll often use it to look up the documentation for functions, variables and so on for the currently-selected completion in a minibuffer.
#+end_quote

#+begin_quote https://old.reddit.com/r/emacs/comments/x7ahgz/how_many_of_you_switched_from_ivycounsel_or_helm/
I find it snappier than ivy

Any package by @minad or @oantolin is of the highest quality.
#+end_quote

doom-emacs made @minad-stack its default.
#+begin_quote https://old.reddit.com/r/emacs/comments/x7ahgz/how_many_of_you_switched_from_ivycounsel_or_helm/
The vertico module on Doom Emacs contains the following packages:

consult
consult-flycheck
embark
embark-consult
marginalia
orderless
vertico
vertico-posframe
wgrep
#+end_quote


#+begin_quote https://github.com/oantolin/embark
Users of the popular which-key package may prefer to use the embark-which-key-indicator from the Embark wiki. Just copy its definition from the wiki into your configuration and customize the embark-indicators user option to exclude the mixed and verbose indicators and to include embark-which-key-indicator.

If you use Vertico, there is an even easier way to get a which-key-like display that also lets you use completion to narrow down the list of alternatives, described at the end of the next section
#+end_quote

#+begin_quote https://github.com/oantolin/embark
Embark cooperates well with the Marginalia and Consult packages. Neither of those packages is a dependency of Embark, but both are highly recommended companions to Embark, for opposite reasons: Marginalia greatly enhances Embark’s usefulness, while Embark can help enhance Consult.
#+end_quote
#+begin_quote https://github.com/oantolin/embark
If you use both Consult and Embark you should install the embark-consult package
#+end_quote
#+begin_quote https://github.com/oantolin/embark
And some videos[on Embark] to watch:
#+end_quote

A trick to making @minad my elisp mentor:- [[file:~/Dropbox/job.org::*Make @Minad my mentor][Make @Minad my mentor]]

#+begin_quote https://old.reddit.com/r/emacs/comments/l99xc8/consult_got_support_for_multiple_candidate_sources/
Right now Consult has a layered architecture. consult--multi -> consult--read --> completing-read --> Selectrum, Icomplete, default completion. I think I prefer this layered, bottom-up architecture since it stacks complexity/functionality step by step.
#+end_quote

