autocompletion_framework.org
** Vertico
#+begin_quote https://github.com/minad/vertico
In order to get accustomed with the package ecosystem, I recommend the following quick start approach:

Start with plain Emacs (emacs -Q).
Install and enable Vertico to get incremental minibuffer completion.
Install Orderless and/or configure the built-in completion styles for more flexible minibuffer filtering.
Install Marginalia if you like rich minibuffer annotations.
Install Embark and add two keybindings for embark-dwim and embark-act. I am using the mnemonic keybindings M-. and C-. since these commands allow you to act on the object at point or in the minibuffer.
Install Consult if you want additional featureful completion commands, e.g., the buffer switcher consult-buffer with preview or the line-based search consult-line.
Install Embark-Consult and Wgrep for export from consult-line to occur-mode buffers and from consult-grep to editable grep-mode buffers.
Fine tune Vertico with extensions.
#+end_quote

#+begin_src emacs-lisp :tangle autocompletion_framework.el
;; Enable vertico
(use-package vertico
  :custom
  ;; (vertico-scroll-margin 0) ;; Different scroll margin
  (vertico-count 25) ;; Show more candidates
  ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
  ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  :init
  (vertico-mode)
  :bind
  (<<vertico/bind>>)
  :hook
  <<vertico/hook>>
  :config
  <<vertico/config>>)
#+end_src

Vertico wiki is a great resource. Vertico doesnt have a documentation page, the wiki is where you go to learn: [[https://github.com/minad/vertico/wiki][Home · minad/vertico Wiki]]

#+begin_src emacs-lisp :noweb-ref "Emacs customisations suggested by @Minad in his Vertico readme"
;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs
  :custom
  ;; Hide commands in M-x which do not work in the current mode.  Vertico
  ;; commands are hidden in normal buffers. This setting is useful beyond
  ;; Vertico.
  (read-extended-command-predicate #'command-completion-default-include-p)
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))
#+end_src

#+begin_quote https://kristofferbalintona.me/posts/202202211546/#fn:2
When using a command for selecting a file in the minibuffer, the following fixes the path so the path you select doesn’t have prepended junk left behind
#+end_quote
#+begin_src emacs-lisp :noweb-ref "vertico/hook"
(rfn-eshadow-update-overlay . vertico-directory-tidy)
#+end_src

I want tab completions inside eshell to use vertico completion. Stolen from [[https://emacs.stackexchange.com/questions/80866/in-shell-buffer-how-do-to-configure-tab-key-to-behave-vertically-like-ve][here]]
#+begin_src emacs-lisp :tangle autocompletion_framework.el
;; Use `consult-completion-in-region' if Vertico is enabled.
;; Otherwise use the default `completion--in-region' function.
(setq completion-in-region-function
      (lambda (&rest args)
        (apply (if vertico-mode
                   #'consult-completion-in-region
                 #'completion--in-region)
               args)))
#+end_src

** Keybindings for common tasks
These were bound to Ivy and Helm alternatives. Lets switch them back to emacs default keybindings. Because, Vertico plays well with builtin emacs commands.
#+begin_src emacs-lisp :noweb-ref "vertico/bind"
("C-x C-r" . recentf)
#+end_src
** find file
I hate that I have to double tab for completion. Fix it by reading [[https://oremacs.com/swiper/#key-bindings-for-single-selection-action-then-exit-minibuffer][Ivy User Manual]]
To replicate the behaviour of how helm does completion during file finding, I need to rebind RET to ~ivy-alt-done~.
#+begin_src emacs-lisp :noweb-ref "To/counsel/config"
(bind-keys :map counsel-find-file-map
           ("<return>" . ivy-alt-done))
#+end_src

#+begin_src emacs-lisp :tangle autocompletion_framework.el
(defun anup/routed/find-file (&optional _prefix)
  "If C-x C-f is called with a prefix argument, open files in current project. Open file with sudo if two prefix arguments are given."
  (interactive "P")
  (cond ((equal current-prefix-arg '(4))
         ;;nil means dont create a new window, reuse current window to open the file in project
         (find-file-in-project nil))
        (t (call-interactively 'find-file-at-point))))

(global-set-key (kbd "C-x C-f") 'anup/routed/find-file)
(global-set-key (kbd "C-x C-d") 'anup/routed/find-file)
(global-set-key (kbd "C-x d") 'anup/routed/find-file)
#+end_src

Below is stolen from [[https://github.com/minad/vertico/wiki#candidate-display-transformations-custom-candidate-highlighting][Home · minad/vertico Wiki]]
#+begin_src emacs-lisp :tangle autocompletion_framework.el
<<Show directories in blue color while find-file>>
#+end_src

#+begin_src emacs-lisp :tangle autocompletion_framework.el
<<Show the currently enabled minor modes in greenish color inside M-x menu>>
#+end_src

*** Show directories in blue color
~+vertico-transform-functions~ is a variable that is defined as part of the Vertico Multiform installtion.
#+begin_src emacs-lisp :noweb-ref "Define a variable that will be used for customizing vertico multiform"
(defvar +vertico-transform-functions nil)
#+end_src
Caution: This variable is also used in [[*Buffers that are in read-only mode should be green in color inside Vertico][this other org heading]]

#+begin_src emacs-lisp :noweb-ref "Show directories in blue color while find-file"
(cl-defmethod vertico--format-candidate :around
  (cand prefix suffix index start &context ((not +vertico-transform-functions) null))
  (dolist (fun (ensure-list +vertico-transform-functions))
    (setq cand (funcall fun cand)))
  (cl-call-next-method cand prefix suffix index start))

(defun +vertico-highlight-directory (file)
  "If FILE ends with a slash, highlight it as a directory."
  (if (string-suffix-p "/" file)
      (propertize file 'face 'marginalia-file-priv-dir) ; or face 'dired-directory
    file))

;; add-to-list works if 'file isn't already in the alist
;; setq can be used but will overwrite all existing values
(add-to-list 'vertico-multiform-categories
             '(file
               (+vertico-transform-functions . +vertico-highlight-directory)))
#+end_src

*** Show currently enabled modes in green color in M-x menu
#+begin_src emacs-lisp :noweb-ref "Show the currently enabled minor modes in greenish color inside M-x menu"
;; function to highlight enabled modes similar to counsel-M-x
(defun +vertico-highlight-enabled-mode (cmd)
  "If MODE is enabled, highlight it as font-lock-constant-face."
  (let ((sym (intern cmd)))
    (if (or (eq sym major-mode)
            (and
             (memq sym minor-mode-list)
             (boundp sym)))
      (propertize cmd 'face 'font-lock-string-face)
      cmd)))

(add-to-list 'vertico-multiform-commands
             '(execute-extended-command 
               (+vertico-transform-functions . +vertico-highlight-enabled-mode)))
#+end_src
*** DONE Intelligent C-x C-f
If cursor is on some text that looks like a file name, it should be copy pasted into find file. Just use ~find-file-at-point~

** Orderless
#+begin_src emacs-lisp :tangle autocompletion_framework.el
;; Optionally use the `orderless' completion style.
(use-package orderless
  :custom
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))
  ;; (orderless-component-separator #'orderless-escapable-split-on-space)
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

** Marginalia
#+begin_src emacs-lisp :tangle autocompletion_framework.el
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))
#+end_src
Marginalia does cause slowdown in =C-h f= menu etc. But, I find it super useful for =C-h v=. Hence, I will tolerate the performance penalty.
