autocompletion_framework.el
;; Enable vertico
(use-package vertico
  :custom
  ;; (vertico-scroll-margin 0) ;; Different scroll margin
  (vertico-count 25) ;; Show more candidates
  ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
  ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  :init
  (vertico-mode)
  :bind
  (("C-x C-r" . recentf))
  :hook
  (rfn-eshadow-update-overlay . vertico-directory-tidy)
  :config
  (use-package vertico-multiform
  :after vertico
  :ensure nil ;;installed automatically as part of vertico. Just enabling this optional extension
  :config
  (vertico-multiform-mode +1)
  (defvar +vertico-transform-functions nil))
(define-key vertico-map (kbd "C-k") (kmacro "C-. k C-g C-x b")))

;; Use `consult-completion-in-region' if Vertico is enabled.
;; Otherwise use the default `completion--in-region' function.
(setq completion-in-region-function
      (lambda (&rest args)
        (apply (if vertico-mode
                   #'consult-completion-in-region
                 #'completion--in-region)
               args)))

(defun anup/routed/find-file (&optional _prefix)
  "If C-x C-f is called with a prefix argument, open files in current project. Open file with sudo if two prefix arguments are given."
  (interactive "P")
  (cond ((equal current-prefix-arg '(4))
         ;;nil means dont create a new window, reuse current window to open the file in project
         (find-file-in-project nil))
        (t (call-interactively 'find-file-at-point))))

(global-set-key (kbd "C-x C-f") 'anup/routed/find-file)
(global-set-key (kbd "C-x C-d") 'anup/routed/find-file)
(global-set-key (kbd "C-x d") 'anup/routed/find-file)

(cl-defmethod vertico--format-candidate :around
  (cand prefix suffix index start &context ((not +vertico-transform-functions) null))
  (dolist (fun (ensure-list +vertico-transform-functions))
    (setq cand (funcall fun cand)))
  (cl-call-next-method cand prefix suffix index start))

(defun +vertico-highlight-directory (file)
  "If FILE ends with a slash, highlight it as a directory."
  (if (string-suffix-p "/" file)
      (propertize file 'face 'marginalia-file-priv-dir) ; or face 'dired-directory
    file))

;; add-to-list works if 'file isn't already in the alist
;; setq can be used but will overwrite all existing values
(add-to-list 'vertico-multiform-categories
             '(file
               (+vertico-transform-functions . +vertico-highlight-directory)))

;; function to highlight enabled modes similar to counsel-M-x
(defun +vertico-highlight-enabled-mode (cmd)
  "If MODE is enabled, highlight it as font-lock-constant-face."
  (let ((sym (intern cmd)))
    (if (or (eq sym major-mode)
            (and
             (memq sym minor-mode-list)
             (boundp sym)))
      (propertize cmd 'face 'font-lock-string-face)
      cmd)))

(add-to-list 'vertico-multiform-commands
             '(execute-extended-command 
               (+vertico-transform-functions . +vertico-highlight-enabled-mode)))

;; Optionally use the `orderless' completion style.
(use-package orderless
  :custom
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))
  ;; (orderless-component-separator #'orderless-escapable-split-on-space)
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

(use-package embark
  :bind
  (("C-." . embark-act)
   ("C-;" . embark-dwim)
