autocompletion_framework.org
** Embark
I was really inspired by this blogpost [[https://karthinks.com/software/fifteen-ways-to-use-embark/][Fifteen ways to use Embark | Karthinks]]

#+begin_quote https://karthinks.com/software/fifteen-ways-to-use-embark/
embark-act: Actually…. & But first…
embark-act is your “Actually…” command. As in, I called package-install and picked a package but actually I’d like to read the package description instead!

embark-act is your “Yes, but first…” command as well. As in, I called find-file but first I’d like to copy it elsewhere to be safe, then continue to open this file!

Or perhaps you want to think of it as a keyboard driven analog of a "right-click" menu in a GUI environment. That works too, but the former maps better to the idea of "late-binding" and laziness that I think of Embark as enabling.
#+end_quote

#+begin_quote https://github.com/oantolin/embark
Embark also has the embark-become command which is useful for when you run a command, start typing at the minibuffer and realize you meant a different command. The most common case for me is that I run switch-to-buffer, start typing a buffer name and realize I haven’t opened the file I had in mind yet! I’ll use this situation as a running example to illustrate embark-become. When this happens I can, of course, press C-g and then run find-file and open the file, but this requires retyping the portion of the file name you already typed. This process can be streamlined with embark-become: while still in the switch-to-buffer you can run embark-become and effectively make the switch-to-buffer command become find-file for this run.

You can bind embark-become to a key in minibuffer-local-map, but it is also available as an action under the letter B (uppercase), so you don’t need a binding if you already have one for embark-act. So, assuming I have embark-act bound to, say, C-., once I realize I haven’t open the file I can type C-. B C-x C-f to have switch-to-buffer become find-file without losing what I have already typed in the minibuffer.
#+end_quote

Default config as per its readme:-
#+begin_src emacs-lisp :tangle autocompletion_framework.el
(use-package embark
  :bind
  (("C-." . embark-act)
   <<Bind embark-dwim>>
   ("C-h B" . embark-bindings)  ;; alternative for `describe-bindings'

   :map embark-file-map
   <<embark/bind/embark-file-map>>

   :map embark-general-map
   <<embark/bind/embark-general-map>>)
  
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
	       '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		 nil
		 (window-parameters (mode-line-format . none))))
  
  <<embark/config>>)
#+end_src

#+begin_quote https://github.com/oantolin/embark
There is also embark-dwim which runs the default action for the first target found. It’s pretty handy in non-minibuffer buffers.
Eg:- Open the URL at point in a web browser
In an Emacs Lisp buffer, if point is on an opening parenthesis or right after a closing one, it will evaluate the corresponding expression. (This kinda replicates functionality of Lispy.el by @abo-abo)
#+end_quote
So, lets bind embark-dwim to a convenient key
#+begin_src emacs-lisp :noweb-ref "Bind embark-dwim"
("C-;" . embark-dwim)
#+end_src

*** Open current find-file candidate as sudo
Stolen from [[https://github.com/oantolin/embark/wiki/Additional-Actions][embark wiki]]
+Make use of the =sudo-edit= function provided by another package.+ It is buggy when used as an embark action. It buggily acts on the current buffer, not the embark selection.
Hence, a helper function stolen from Karthinks
#+begin_src emacs-lisp :noweb-ref "embark/config"
(defun sudo-find-file (file)
  "Open FILE as root."
  (interactive "FOpen file as root: ")
  (when (file-writable-p file)
    (user-error "File is user writeable, aborting sudo"))
  (find-file (if (file-remote-p file)
                 (concat "/" (file-remote-p file 'method) ":"
                         (file-remote-p file 'user) "@" (file-remote-p file 'host)
                         "|sudo:root@"
                         (file-remote-p file 'host) ":" (file-remote-p file 'localname))
               (concat "/sudo:root@localhost:" file))))
#+end_src

#+begin_src emacs-lisp :noweb-ref "embark/bind/embark-file-map"
;;("S" . sudo-edit)
("S" . sudo-find-file)
#+end_src

Above doesnt work inside counsel-recentf. For that, I need to define in the embark general map too:-
#+begin_src emacs-lisp :noweb-ref "embark/bind/embark-general-map"
;;("S" . sudo-edit)
("S" . sudo-find-file)
#+end_src

Example usecase:-
=C-x C-r= and locate ~/etc/hosts~
=C-.= to invoke =embark-act=. Mnemonic: /embark actually/, ie Actually I meant to open this file as root user.
Press =S= to sudo-edit


*** Embark kill buffer action
#+begin_src emacs-lisp :noweb-ref "embark/bind/embark-general-map"
("k" . kill-buffer)
#+end_src

These two lines allow you to kill buffers  without closing the mini-buffer and without a confirmation respectively.
#+begin_src emacs-lisp :noweb-ref "embark/config"
(setq embark-quit-after-action '((t . t) (kill-buffer . nil)))
(setf (alist-get 'kill-buffer embark-pre-action-hooks) nil)
#+end_src
Leaving minibuffer open to quickly kill multiple buffers if needed.

The odd looking ~'(t .t)~ is for specifying a default for all other actions.
ie, for all other embark actions, by default, do quit the minibuffer.
** Smex - recently used M-x commands show at top
#+begin_src emacs-lisp :tangle autocompletion_framework.el
(use-package smex
  :config
  (smex-initialize))
#+end_src
smex saves the recently used commands to a file on disk.
Vertico automagically picks up that file.
