autocompletion_framework.el
   ("C-h B" . embark-bindings)  ;; alternative for `describe-bindings'

   :map embark-file-map
   ;;("S" . sudo-edit)
("S" . sudo-find-file)

   :map embark-general-map
   ;;("S" . sudo-edit)
("S" . sudo-find-file)
("k" . kill-buffer)
("G" . browse-url-dwim-search)
("C-c g" . browse-url-dwim-search))
  
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
	       '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		 nil
		 (window-parameters (mode-line-format . none))))
  
  (defun sudo-find-file (file)
  "Open FILE as root."
  (interactive "FOpen file as root: ")
  (when (file-writable-p file)
    (user-error "File is user writeable, aborting sudo"))
  (find-file (if (file-remote-p file)
                 (concat "/" (file-remote-p file 'method) ":"
                         (file-remote-p file 'user) "@" (file-remote-p file 'host)
                         "|sudo:root@"
                         (file-remote-p file 'host) ":" (file-remote-p file 'localname))
               (concat "/sudo:root@localhost:" file))))
(setq embark-quit-after-action '((t . t) (kill-buffer . nil)))
(setf (alist-get 'kill-buffer embark-pre-action-hooks) nil))

(use-package smex
  :config
  (smex-initialize))
