autocompletion_framework.el

;; Example configuration for Consult
(use-package consult
  :bind
  (
   ;;("M-s" . consult-ripgrep)  ;;I prefer to use M-s as a prefix key
   ([remap Info-search] . consult-info)
   ("M-g M-g" . consult-goto-line)
   ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
   ;;("M-s r" . consult-ripgrep)             ;; I prefer to use helm-rg bound to M-g M-s instead
   :map org-mode-map
   ;;("M-g h" . consult-org-heading)
   ("M-g h" . consult-org-heading)
   )
  ;; Replace bindings. Lazily loaded by `use-package'.
  ;;;;;;;;Re-enable after making M-s a prefix key
  ;;;;;;          :bind (;; C-c bindings in `mode-specific-map'
  ;;;;;;                 ("C-c M-x" . consult-mode-command)
  ;;;;;;                 ("C-c h" . consult-history)
  ;;;;;;                 ("C-c k" . consult-kmacro)
  ;;;;;;                 ("C-c m" . consult-man)
  ;;;;;;                 ("C-c i" . consult-info)
  ;;;;;;                 ;; C-x bindings in `ctl-x-map'
  ;;;;;;                 ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
  ;;;;;;                 ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
  ;;;;;;                 ;; Custom M-# bindings for fast register access
  ;;;;;;                 ("M-#" . consult-register-load)
  ;;;;;;                 ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
  ;;;;;;                 ("C-M-#" . consult-register)
  ;;;;;;                 ;; Other custom bindings
  ;;;;;;                 ("M-y" . consult-yank-pop)                ;; orig. yank-pop. I found the posframe annoying for this.
  ;;;;;;                 ;; M-g bindings in `goto-map'
  ;;;;;;                 ("M-g e" . consult-compile-error)
  ;;;;;;                 ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
  ;;;;;;                 ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
  ;;;;;;                 ("M-g m" . consult-mark)
  ;;;;;;                 ("M-g k" . consult-global-mark)
  ;;;;;;                 ("M-g i" . consult-imenu)
  ;;;;;;                 ("M-g I" . consult-imenu-multi)
  ;;;;;;                 ;; M-s bindings in `search-map'
  ;;;;;;                 ("M-s d" . consult-find)                  ;; Alternative: consult-fd. Found it confusing. I prefer find-file-in-project
  ;;;;;;                 ("M-s c" . consult-locate)
  ;;;;;;                 ("M-s g" . consult-grep)
  ;;;;;;                 ("M-s G" . consult-git-grep)
  ;;;;;;                 
  ;;;;;;                 ("M-s l" . consult-line)
  ;;;;;;                 ("M-s L" . consult-line-multi)
  ;;;;;;                 ("M-s k" . consult-keep-lines)
  ;;;;;;                 ("M-s u" . consult-focus-lines)
  ;;;;;;                 ;; Isearch integration
  ;;;;;;                 ("M-s e" . consult-isearch-history)
  ;;;;;;                 :map isearch-mode-map
  ;;;;;;                 ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
  ;;;;;;                 ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
  ;;;;;;                 ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
  ;;;;;;                 ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
  ;;;;;;                 ;; Minibuffer history
  ;;;;;;                 :map minibuffer-local-map
  ;;;;;;                 ("M-s" . consult-history)                 ;; orig. next-matching-history-element
  ;;;;;;                 ("M-r" . consult-history))                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (keymap-set consult-narrow-map (concat consult-narrow-key " ?") #'consult-narrow-help)

  
)

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package wgrep)
