autocompletion_framework.org
** Switch to buffer
It should include buffers from all frames

~buffer-list~ when called with a frame will order the buffers based on that frame's recency. Buffers from other frames will be *included* too.

Filter out boring buffers
#+begin_src emacs-lisp :noweb-ref "Sorted list of buffers"
(anup/remove-matching-items (mapcar #'buffer-name (buffer-list (selected-frame)))
                            '("\\`\\*tramp/" "\\` \\*" "\\`\\*Echo Area" "\\`\\*Minibuf" "\\`\\*helm" "\\`\\*Compile-Log" "\\`\\*straight-process" "\\`\\*quelpa-build-checkout" "tq-temp-epdfinfo" "magit-process:*" "*Kill Ring*" "*XELB-DEBUG*"))
#+end_src

This list needs a minor tweak. The current buffer is at the top of the list. Better to push the current buffer to the bottom of the list.
#+begin_src emacs-lisp :noweb-ref "A list of buffers to switch to"
(let* ((buffer-names <<Sorted list of buffers>>)
       (current-buffer-name (car buffer-names))
       (other-buffer-names (cdr buffer-names))
       (list-of-buffers-to-switch-to (append other-buffer-names (list current-buffer-name)))
       (list-of-buffers-to-switch-to <<Mark them as buffer>>))
  list-of-buffers-to-switch-to)
#+end_src

If I annotate my list of completion candidates with the metadata of ~'buffer~, then, vertico is able to provide more context aware info about them.
I stole a helper command for adding metadata from [[https://kisaragi-hiu.com/emacs-completion-metadata/][here]] and added it to [[*Helper functions][my helper functions.]]

#+begin_quote https://www.gnu.org/software/emacs/manual/html_node/elisp/Completion-Variables.html
category is a symbol describing what is being completed; currently, the buffer, file, and unicode-name categories are defined
#+end_quote
#+begin_src emacs-lisp :noweb-ref "Mark them as buffer"
(anoop/mark-category list-of-buffers-to-switch-to 'buffer)
#+end_src

Make a call to Vertico, through making a call to builtin ~completing-read~
#+begin_src emacs-lisp :noweb-ref "Call Vertico and Get the name of the buffer to switch to"
(completing-read "Switch to Buffer: " <<A list of buffers to switch to>>)
#+end_src

#+begin_src emacs-lisp :tangle autocompletion_framework.el
<<Helpers for anoop/switch-to-buffer>>
(defun anoop/switch-to-buffer ()
  (interactive)
  (switch-to-buffer <<Temporarily trick vertico into altering its face behaviour. And its sorting behaviour. Then call completing-read in that trickster environment to get the name of the buffer to switch to.>>))

(global-set-key (kbd "C-x b") 'anoop/switch-to-buffer)
;;(global-set-key (kbd "C-x C-b") 'anoop/switch-to-buffer) ;;because, its bound to helm version
#+end_src
*** Buffers that are in read-only mode should be green in color inside Vertico
This green gives me peace of mind.

[[https://github.com/minad/vertico/wiki#candidate-display-transformations-custom-candidate-highlighting][Home · minad/vertico Wiki/Candidate display transformations, custom candtaied highlighting]]
This functionality expects that ~vertico-multiform-mode~ is enabled. It is a global minor mode that comes bundled with Vertico. Hence, lets enable it.
#+begin_src emacs-lisp :noweb-ref "vertico/config"
(use-package vertico-multiform
  :after vertico
  :ensure nil ;;installed automatically as part of vertico. Just enabling this optional extension
  :config
  (vertico-multiform-mode +1)
  <<Define a variable that will be used for customizing vertico multiform>>)
#+end_src
---------------------------------------------------------------------------------------------------
A short and sweet working demo:-
#+begin_src emacs-lisp
(defun +vertico-greenify-demo (candidate0)
  "If input string is anoop, turn it into green color"
  (if (string= candidate0 "anoop")
      (propertize candidate0 'face 'anoop-read-only-mode-greenish-face)
    candidate0))

(let ((vertico-multiform-categories  '((symbol (+vertico-transform-functions . +vertico-greenify-demo)))))
  (completing-read "Notice that anoop is in greenish color: " '(dog cat mousey anoop "anoop")))
;;; Above is a working demo. Yay!
#+end_src
^Caution: Above block might be depending on vertico-multiform config inside [[*Show directories in blue color][this other org heading]]
Above demo gives me the confidence that my approach is correct. Below, I can neatly implement the above idea.
---------------------------------------------------------------------------------------------------
Helper: Given a string buffer name, +check if an emacs buffer of that name is open (always true). If so,+
check whether that buffer is +open+ in read-only-mode. If so, return true.
#+begin_src emacs-lisp :noweb-ref "Helpers for anoop/switch-to-buffer"
(defun anoop/helper/_read-only-p (bname)
  "Predicate that checks if buffer named bname is open in read only mode"
  (with-current-buffer bname
    buffer-read-only))
#+end_src

Below is created by modifying the example function from vertico wiki
#+begin_src emacs-lisp :noweb-ref "Helpers for anoop/switch-to-buffer"
(defun +vertico-greenify-read-only-buffers (completion-candidate-string0)
  "If buffer is opened in read only mode, add green color to this text"
  (if (anoop/helper/_read-only-p completion-candidate-string0)
      (propertize completion-candidate-string0 'face 'anoop-read-only-mode-greenish-face)
    completion-candidate-string0))
#+end_src

Let me define a greenish face which is to be applied
#+begin_src emacs-lisp :noweb-ref "Helpers for anoop/switch-to-buffer"
(defface anoop-read-only-mode-greenish-face
  '((t (:foreground "forest green")))
  "The face used for read only buffers inside Vertico 'C-x b' completion")
#+end_src

Temporarily alter internal variable of vertico. This variable has the power to change the face of vertico candidates.
In this trickster environment, ~completing-read~ is duped into using our custom scheme for adding face.
#+begin_src emacs-lisp :noweb-ref "Temporarily trick vertico into altering its face behaviour. And its sorting behaviour. Then call completing-read in that trickster environment to get the name of the buffer to switch to."
(let ((vertico-multiform-categories  '(;;I have no idea why both the below are required. But, commenting either one of them -
                                       ;;-makes greenish color fail to apply
                                       (symbol (+vertico-transform-functions . +vertico-greenify-read-only-buffers))
                                       (buffer (+vertico-transform-functions . +vertico-greenify-read-only-buffers))))
      ;;Below makes vertico not mess with the order of items in the list given to completing-read
      (vertico-sort-function nil))
  <<Call Vertico and Get the name of the buffer to switch to>>)
#+end_src

**** COMMENT inbox
Vertico multiform can be customized on a per command basis. This trick may be used to provide the same functionality as above /trick environment/. Someday maybe, refactor.

You can learn more about how to configure ~vertico-multiform-categories~ from:-
#+begin_quote https://kristofferbalintona.me/posts/202202211546/
 with vertico-multiform-mode as well as configuration of vertico-multiform-categories, vertico-multiform-commands, and keybinds, you can enable/disable multiple of these formats
#+end_quote


** Kill buffers from the buffer list
#+begin_quote https://old.reddit.com/r/emacs/comments/v9w03w/have_the_cool_kids_moved_from_ivy_counsel_to/
A keyboard macro is a simple solution here: if you bind embark-act to C-. you can simply bind C-k to C-. k
#+end_quote
#+begin_src emacs-lisp
(define-key vertico-map (kbd "C-k") (kmacro "C-. k"))
#+end_src
^Killing a X-buffer results in inconsistent state inside Vertico. This can be fixed if I exit the minibuffer (C-g) and invoke vertico again (C-x b). Do this using kmacro:
#+begin_src emacs-lisp :noweb-ref "vertico/config"
(define-key vertico-map (kbd "C-k") (kmacro "C-. k C-g C-x b"))
#+end_src
There is a minor bug. To kill EXWM X-buffers, I need to call =C-k= twice.

TODO: Like helm, being able to mark multiple buffers and act on them at once using =C-<space>=
For killing multiple buffers, just use the helm version until this feature is added.

** COMMENT Posframe
^Posframe is really pretty! But, it is also somewhat buggy with plenty of paper cuts.
For example, a really wide filename was causing posframe text rendering to break!
Also, it is noticably slower than vanilla Vertico.
Hence, decided to disable Posframe.

#+begin_src emacs-lisp :tangle autocompletion_framework.el
(use-package posframe
  :if (display-graphic-p)
  :config
  <<posframe/config>>)
#+end_src

Banish mouse in posframes, exwm specific setting
#+begin_src emacs-lisp :noweb-ref "posframe/config"
(setq posframe-mouse-banish-function #'posframe-mouse-banish-simple)
#+end_src

Vertico posframe pops up Vertico in a new temperory frame.
#+begin_src emacs-lisp :tangle autocompletion_framework.el
(use-package vertico-posframe
  :if (display-graphic-p)
  :config
  <<vertico-posframe/config>>
  (vertico-posframe-mode +1))
#+end_src

#+begin_quote https://github.com/tumashu/vertico-posframe
How to let vertico-posframe work well with vertico-multiform.
#+end_quote
#+begin_src emacs-lisp :noweb-ref "vertico/config"
(setq vertico-multiform-commands
      '((consult-line
         posframe
         (vertico-posframe-poshandler . posframe-poshandler-frame-top-center)
         (vertico-posframe-border-width . 10)
         ;; NOTE: This is useful when emacs is used in both in X and
         ;; terminal, for posframe do not work well in terminal, so
         ;; vertico-buffer-mode will be used as fallback at the
         ;; moment.
         (vertico-posframe-fallback-mode . vertico-buffer-mode))

        <<Dont use posframe for M-. and consult yank pop>>
        
        (t posframe)))
(vertico-multiform-mode 1)
#+end_src

I dont like the Vertico posframe changing its width and height randomly based on its content.
Just ask it to use a fixed size.
#+begin_src emacs-lisp :noweb-ref "vertico-posframe/config"
(setq vertico-posframe-width 120)
(setq vertico-posframe-height 30)
#+end_src

Let me use a fancy custom font inside posframe.
VC Honey Deck may be a good font for posframe.

#+begin_src emacs-lisp :noweb-ref "vertico-posframe/config"
;;(setq vertico-posframe-font "Comic Sans MS 18")
;;(setq vertico-posframe-font "Comic Neue 20")
(setq vertico-posframe-font "Roboto 20")
#+end_src
You can reset the font using (setq vertico-posframe-font nil)

I dont like posframe when browsing the kill ring using consult. So, disable vertico-posframe for that specific command
#+begin_src emacs-lisp :noweb-ref "Dont use posframe for M-. and consult yank pop"
(consult-yank-pop (:not posframe))
(anoop/routed/goto (:not posframe))
#+end_src
I still dont like the style used by ~consult-yank-pop~. Only one line is used per entry. I wish it used as many lines per entry as needed by the copied text.
Someday, I would like to replicate the UI of ~browse-kill-ring~

*** google search
I would love to run my google searches using posframe. All I need is a small Vertico wrapper for ~browse-url-dwim-search~
#+begin_src emacs-lisp :tangle autocompletion_framework.el
(defun anoop/browse-url-dwim-search ()
  (interactive)
  (browse-url-dwim-search (let ((vertico-count-format nil))
                            (completing-read " Google search for: " '()))))

(global-set-key (kbd "C-c g") 'anoop/browse-url-dwim-search)
(global-set-key (kbd "C-c C-g") 'anoop/browse-url-dwim-search)
#+end_src
^It crashes emacs if invoked at the end of a line containing an image file. Also, its last update was in 2014.

*** posframe for which-key and transient
#+begin_quote https://old.reddit.com/r/emacs/comments/1fozctm/weekly_tips_tricks_c_thread/
[–]ImJustPassinBy 13 points 1 month ago* 
I recently got tired of constantly having to move my eyes to the bottom of Emacs, so I switched to posframes, which moves the information in a central pop-up instead. For me, this meant using the packages:

vertico-posframe - for vertico
which-key-posframe - for which-key
transient-posframe - for all transient commands, e.g., in magit or in casual-suite
But regardless what you are using, chances are there already is a suitable *-posframe package for it. Installing these packages is easy
#+end_quote

#+begin_src emacs-lisp
(use-package which-key-posframe
  :if (display-graphic-p)
  :init
  (which-key-posframe-mode +1))
#+end_src
I find that which-key doesnt render within the frame sometimes. Its left half is invisible as it overflows the left border of the frame. Hence, disabled it.

#+begin_src emacs-lisp :tangle autocompletion_framework.el
(use-package transient-posframe
  :if (display-graphic-p)
  :init
  (transient-posframe-mode +1)
  :config
  (setq transient-posframe-min-width 50))
#+end_src
^Transient is used by magit prompt.

Here's @minad's opinion on posframe
#+begin_quote https://gist.github.com/rougier/126e358464e12aa28fac5b4f3dd5eb9c
Did you consider vertico-posframe instead of mini-frame? From my experience vertico-posframe is slightly more robust. However overall I am critical of using child frames for various technical reasons as documented here. 
#+end_quote
Here's Rougier's take on the same: [[https://github.com/rougier/nano-vertico][rougier/nano-vertico: Emacs / nano + vertico]]

Do checkout =company-posframe= and =flycheck-posframe=

I hate that posframes hide the content of the buffer under them.

