autocompletion_framework.el

(defun anoop/helper/_read-only-p (bname)
  "Predicate that checks if buffer named bname is open in read only mode"
  (with-current-buffer bname
    buffer-read-only))
(defun +vertico-greenify-read-only-buffers (completion-candidate-string0)
  "If buffer is opened in read only mode, add green color to this text"
  (if (anoop/helper/_read-only-p completion-candidate-string0)
      (propertize completion-candidate-string0 'face 'anoop-read-only-mode-greenish-face)
    completion-candidate-string0))
(defface anoop-read-only-mode-greenish-face
  '((t (:foreground "forest green")))
  "The face used for read only buffers inside Vertico 'C-x b' completion")
(defun anoop/switch-to-buffer ()
  (interactive)
  (switch-to-buffer (let ((vertico-multiform-categories  '(;;I have no idea why both the below are required. But, commenting either one of them -
                                       ;;-makes greenish color fail to apply
                                       (symbol (+vertico-transform-functions . +vertico-greenify-read-only-buffers))
                                       (buffer (+vertico-transform-functions . +vertico-greenify-read-only-buffers))))
      ;;Below makes vertico not mess with the order of items in the list given to completing-read
      (vertico-sort-function nil))
  (completing-read "Switch to Buffer: " (let* ((buffer-names (anup/remove-matching-items (mapcar #'buffer-name (buffer-list (selected-frame)))
                            '("\\`\\*tramp/" "\\` \\*" "\\`\\*Echo Area" "\\`\\*Minibuf" "\\`\\*helm" "\\`\\*Compile-Log" "\\`\\*straight-process" "\\`\\*quelpa-build-checkout" "tq-temp-epdfinfo" "magit-process:*" "*Kill Ring*" "*XELB-DEBUG*")))
       (current-buffer-name (car buffer-names))
       (other-buffer-names (cdr buffer-names))
       (list-of-buffers-to-switch-to (append other-buffer-names (list current-buffer-name)))
       (list-of-buffers-to-switch-to (anoop/mark-category list-of-buffers-to-switch-to 'buffer)))
  list-of-buffers-to-switch-to)))))

(global-set-key (kbd "C-x b") 'anoop/switch-to-buffer)
;;(global-set-key (kbd "C-x C-b") 'anoop/switch-to-buffer) ;;because, its bound to helm version
